read_verilog module/top.v
hierarchy -check -top top
proc; opt; memory; fsm; opt
techmap; opt
dfflibmap -liberty lib/simple.lib
abc -liberty lib/simple.lib
opt
write_verilog -norename -noattr cmp.v
