read_verilog module/alu_8bit_min.v
hierarchy -check -top alu_8bit
proc; opt; memory; fsm; opt
techmap; opt
dfflibmap -liberty lib/simple.lib
abc -liberty lib/simple.lib
clean
write_verilog -norename -noattr cmp.v
