read_verilog ./module/selesai/alu.v
hierarchy -check -top alu
proc; opt; memory; fsm; opt
techmap; opt
dfflibmap -liberty lib/simple.lib
abc -liberty lib/simple.lib
clean
write_verilog -norename -noattr cmp.v
